# DuctPressureDropData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData Class
Members See Also
---
The input and output data used by external servers for calculation of the duct pressure drop.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuctPressureDropData : IDisposable
```

Visual Basic
---
```text
Public Class DuctPressureDropData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DuctPressureDropData : IDisposable
```

# Remarks
Profile type, Height, Diameter for round profile or width for other profiles, Length, Density, Viscosity, Roughness and Flow are input field values for the calculation. HydraulicDiameter, ReynoldsNumber, Velocity, VelocityPressure, Friction, PressureDrop, and Coefficient are output field values for the calculation
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..DuctPressureDropData
# See Also
DuctPressureDropData Members
Autodesk.Revit.DB.Mechanical Namespace